### DataFrame1

In [1]:
import numpy as pd
import pandas as pd

In [2]:
df1=pd.read_csv("C:\\Users\\deves\\Desktop\\covid_toy.csv")

In [3]:
df1.head(2)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes

In [4]:
x=df1.drop(columns=['cough'] , axis=1)
type(x)

pandas.core.frame.DataFrame

In [5]:
x.head(2)

   age gender  fever     city has_covid
0   60   Male  103.0  Kolkata        No
1   27   Male  100.0    Delhi       Yes

In [9]:
y=df1['cough']

In [11]:
print("Total data shape=  ", df1.shape)
print("Independent data shape", x.shape)
print("Dependent data shape", y.shape)

Total data shape=   (100, 6)
Independent data shape (100, 5)
Dependent data shape (100,)

In [13]:
from sklearn.model_selection import train_test_split

In [14]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size = 0.2 , random_state = 42)

In [16]:
print("Total data shape=" ,df1.shape)
print("Independent data shape= ", x.shape)
print("Dependent data shape = ", y.shape) 
print("X_train data shape=", x_train.shape)
print("X_test data shape", x_test.shape)

Total data shape= (100, 6)
Independent data shape=  (100, 5)
Dependent data shape =  (100,)
X_train data shape= (80, 5)
X_test data shape (20, 5)

### DataFrame2

In [17]:
df2=pd.read_csv("C:\\Users\\deves\\Desktop\\tips.csv")

In [18]:
df2.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [21]:
a=df2.drop(columns=['smoker'] , axis=1)
type(a)

pandas.core.frame.DataFrame

In [22]:
a.head(2)

   total_bill   tip     sex  day    time  size
0       16.99  1.01  Female  Sun  Dinner     2
1       10.34  1.66    Male  Sun  Dinner     3

In [24]:
b=df2['tip']

In [26]:
print("Total data shape= H ", df2.shape)
print("Independent data shape", a.shape)
print("Dependent data shape", b.shape)

Total data shape= H  (244, 7)
Independent data shape (244, 6)
Dependent data shape (244,)

In [27]:
from sklearn.model_selection import train_test_split

In [29]:
a_train , a_test , b_train , b_test = train_test_split(a,b,test_size = 0.2 , random_state = 42)

In [30]:
print("Total data shape=" ,df2.shape)
print("Independent data shape= ", a.shape)
print("Dependent data shape = ", b.shape) 
print("X_train data shape=", a_train.shape)
print("X_test data shape", b_test.shape)

Total data shape= (244, 7)
Independent data shape=  (244, 6)
Dependent data shape =  (244,)
X_train data shape= (195, 6)
X_test data shape (49,)

### DataFrame3

In [31]:
df3=pd.read_csv("C:\\Users\\deves\\Desktop\\titanic.csv")

In [32]:
df3.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [34]:
x1=df3.drop(columns=['Survived'] , axis = 1) ### independent data
type(x1)

pandas.core.frame.DataFrame

In [35]:
x1.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [38]:
y1=df3['Survived']